[
    {
      "logoSrc": "/images/testimonials/logo/1.png",
      "testimonialText": "I wanted to take a moment to express my heartfelt thanks for the prompt and professional assistance I’ve received throughout my dealings with JB Finance Company. From the very beginning, your staff has been incredibly helpful and efficient, ensuring a smooth process every step of the way. I truly appreciate the care and attention to detail that went into addressing my needs. Please extend my gratitude to the entire team for their support. It has been a pleasure working with such a dedicated group of professionals. Thank you once again for your excellent service.",
      "testimonialImageSrc": "/images/testimonials/user/1.png",
      "name": "Gamini Jayasuriya",
      "designation": "Managing Director, Financial Solutions Ltd."
    },
    {
      "logoSrc": "/images/testimonials/logo/2.png",
      "testimonialText": "We have been investing in the JB Money Market Fund for many years and in the Gilt fund since its inception. We are very happy with the service. The ability to invest and exit at short notice is a great advantage.",
      "testimonialImageSrc": "/images/testimonials/user/2.png",
      "name": "Saboor Chatoor (Pvt) Ltd",
      "designation": "Senior Investment Analyst, Capital Growth Inc."
    },
    {
      "logoSrc": "/images/testimonials/logo/3.png",
      "testimonialText": "From the moment I first spoke to JB Financial, they took time to understand my financial needs and helped me to invest in a manner that suits me, rather than a cookie cutter solution. The team headed by Murtaza Jafferjee is of the highest integrity and always have my interests at heart. Thanks to them I have the confidence that my money is working for me as it should.",
      "testimonialImageSrc": "/images/testimonials/user/3.png",
      "name": "Shyamica Fernando",
      "designation": "Chief Financial Officer, Wealth Builders Co."
    },
    {
      "logoSrc": "/images/testimonials/logo/4.png",
      "testimonialText": "It's hard to find the time or energy to manage a portfolio alongside the many other things life demands of you, so I find it very convenient to invest through JB Financial's suite of products. I still get to invest and earn a return, without any of the hassle!",
      "testimonialImageSrc": "/images/testimonials/user/4.png",
      "name": "Hakiem Hanif",
      "designation": "Portfolio Manager, Secure Invest Ltd."
    },
    {
      "logoSrc": "/images/testimonials/logo/4.png",
      "testimonialText": "As a long-time investor with JBMMF I've been consistently impressed by their exceptional customer service & ROI. Their team of experts is always available to provide clear and concise explanations, addressing any questions or concerns promptly. Their commitment to transparency and trust has made me confident in my investment decisions. I highly recommend JB VANTAGE to anyone seeking a reliable and trustworthy investment partner.",
      "testimonialImageSrc": "/images/testimonials/user/4.png",
      "name": "Chamara De Silva",
      "designation": "Portfolio Manager, Secure Invest Ltd."
    }
  ]
  